app/Controllers/Caktivitas.php

    public function Aktivitas()
    {
        $data['aktivitas'] = $this->aktivitas->findAll();
---
SELECT *
FROM `aktivitas`