app/Controllers/Cmakanan.php

    public function index()
    {
        //ngambil semua data yg ada di tb makanan
        $data['makanan'] = $this->makanan->findAll();
---
SELECT *
FROM `makanan`