app/Controllers/Cpharris.php

SELECT *
FROM `status_badan`
WHERE `ID_USER` = '4'
 LIMIT 1
---
    function AKE()
    {
        $this->hitungharris =new M_Perhitungan_Harris();
        $data['Gender'] = session()->get('gender');
        $data['TB'] = session()->get('TINGGI_BADAN');
        $data['BB'] = session()->get('BERAT_BADAN');
        $data['U'] = session()->get('USIA');
        $data['hasilKalSem'] = (float) $this->hitungharris->hitung($data['Gender'],$data['TB'],$data['BB'],$data['U']);

        $akti= new M_Aktivitas();
        $pilihan = $this->request->getVar('pilkeg');
        $builder = $akti ;
        $builder->select('KATEGORI_KEGIATAN');       // names of your columns
        $builder->where('NAMA_KEGIATAN', $pilihan);                // where clause
        $query = $builder->get()->getResult();
        $data['Nkategori'] =  json_encode($query);

        $data['hasilAKE'] = (float) $this->hitungharris->AKE($data['hasilKalSem'], $data['Nkategori']);
        $data['hasilGIKarbo'] = (float) $this->hitungharris->AKEKarbo($data['hasilAKE']);
        $data['hasilGILemak'] = (float) $this->hitungharris->AKELemak($data['hasilAKE']);
        $data['hasilGIProte'] = (float) $this->hitungharris->AKEProte($data['hasilAKE']);

        //$data['hasilSKarbo'] = (float) $this->hitungharris->SKarbo($data['hasilGIKarbo']);
        //$data['hasilSLemak'] = (float) $this->hitungharris->SLemak($data['hasilGILemak']);
        //$data['hasilSProteH'] = (float) $this->hitungharris->SProteH($data['hasilGIProte']);
        //$data['hasilSProteN'] = (float) $this->hitungharris->SProteN($data['hasilGIProte']);

        $SB = new M_Status_Badan();
        $dataSB['DSB'] = $SB->where([
            'ID_USER' => session()->get('ID_USER')
        ])->first();

SELECT `ID_AKTIVITAS`
FROM `aktivitas`
WHERE `NAMA_KEGIATAN` = 'mengetik'
---
        // ambil id_aktivitas
        $builder->select('ID_AKTIVITAS');
        $builder->where('NAMA_KEGIATAN', $pilihan);
        $query = $builder->get()->getResult();

INSERT INTO `riwayat` (`ID_USER`, `ID_AKTIVITAS`, `KARBOHIDRAT`, `LEMAK`, `PROTEIN`, `CREATED_AT`) VALUES ('4', '4', 147.038125, 22.118555555556, 29.407625, '2022-07-29 03:19:50')
---
            'CREATED_AT'    => date('Y-m-d H:i:s'),
        ];
        // insert riwayat
        $this->riwayat->INSERT($dataRiwayat);