app/Controllers/Cuser.php

SELECT *
FROM `user`
---
    public function index()
    {
        $data['user'] = $this->user->findAll();

SELECT *
FROM `user`
WHERE `USERNAME` = 'qq'
 LIMIT 1
---
    public function prosesLogin()
    {
        $user = new M_user();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $dataUser = $user->where([
            'USERNAME' => $username
        ])->first();

UPDATE `user` SET `NAMA_LENGKAP` = 'ww', `EMAIL` = 'ww@gmail.com', `USERNAME` = 'rr', `USIA` = '20', `GENDER` = 'Perempuan', `TINGGI_BADAN` = '123', `BERAT_BADAN` = '12', `FOTO` = '1659082631_d376b89e2e37b65f83b0.jpeg'
WHERE `user`.`ID_USER` IN ('8')
SELECT *
FROM `user`
WHERE `ID_USER` = '8'
 LIMIT 1
---
    public function update($id)
    {
        $user = new M_user();
        $upload = $this->request->getFile('profile');
        $newName = $upload->getRandomName();
        $upload->move(WRITEPATH . '../public/profile', $newName);
        $this->user->update($id, [
            'NAMA_LENGKAP' => $this->request->getVar('namaL'),
            'EMAIL' => $this->request->getVar('email'),
            'USERNAME' => $this->request->getVar('username'),
            'USIA' => $this->request->getVar('usia'),
            'GENDER' => $this->request->getVar('gender'),
            'TINGGI_BADAN' => $this->request->getVar('tinggiB'),
            'BERAT_BADAN' => $this->request->getVar('beratB'),
            'FOTO' => $newName
        ]);
        $dataUser = $user->where([
            'ID_USER' => session()->get('ID_USER')
        ])->first();