app/Models/M_Riwayat.php

SELECT *
FROM `riwayat`
ORDER BY `ID_RIWAYAT` DESC
 LIMIT 1
---
    public function getLastID()
    {
        $builder = $this->db->table('riwayat');
        $builder->select('*');
        $builder->orderBy('ID_RIWAYAT', 'DESC');
        $builder->limit(1);
        $query = $builder->get()->getResult();