app/Models/M_Status_Badan.php

    public function getDataIDStatus($id_status)
    {
        $builder = $this->db->table('status_badan');
        // $builder->select("*");
        $builder->where(['ID_STATUS' => $id_status]);
        $query = $builder->get();
---
SELECT *
FROM `status_badan`
WHERE `ID_STATUS` = '5'